$('[data-toggle="tooltip "]').tooltip();
$(".preloader ").fadeOut();

$(document).ready(function() {
    $("#show_hide_password a").on('click', function(event) {
        event.preventDefault();
        if($('#show_hide_password input').attr("type") == "text"){
            $('#show_hide_password input').attr('type', 'password');
            $('#show_hide_password i').addClass( "fa-eye-slash" );
            $('#show_hide_password i').removeClass( "fa-eye" );
        }else if($('#show_hide_password input').attr("type") == "password"){
            $('#show_hide_password input').attr('type', 'text');
            $('#show_hide_password i').removeClass( "fa-eye-slash" );
            $('#show_hide_password i').addClass( "fa-eye" );
        }
    });
});

var checkbox = document.getElementById("termsOFService");
function checkbox_changed() {
    if (checkbox.checked == true) {
        Swal.fire({
            title: '<div class="font-14">เงื่อนไขการใช้บริการ</div>',
            html:
                '<div class="font-12 text-left">1. เพื่อความสะดวกในการขนส่ง คุณลูกค้ากรุณาแจ้งประเภทสินค้าที่ต้องการส่งกับเจ้าหน้าที่ทุกครั้ง <br/> ' +
                '2. การชำระเงินค่าขนส่ง คุณลูกค้ากรุณาชำระเงินเมื่อมีการเรียกเก็บค่าขนส่งจากทางบริษัทฯ ทั้งนี้บริษัทขอสงวนสิทธิ์ไม่จัดส่งสินค้าหากยังไม่ได้รับการชำระค่าบริการขนส่งอย่างถูกต้อง<br/> ' +
                '3. การรับสินค้า หากคุณลูกค้าพบว่าสินค้ามีปัญหากรุณาแจ้งเจ้าหน้าที่โดยทันทีหรือแจ้งภายใน 3 วันนับจากได้รับสินค้า หากเกินเวลาที่กำหนดบริษัทฯขอสงวนสิทธิ์ไม่รับผิดชอบทุกกรณี<br/> ' +
                '3.1 กรณีสินค้าทั่วไป หากสินค้าเกิดความเสียหายหรือสูญหาย อันเกิดจากการขนส่งระหว่างประเทศ ทางบริษัทฯยินดีรับผิดชอบแต่ไม่เกิน3เท่าของค่าขนส่ง(หากคุณลูกค้าไม่ได้ทำประกันคุ้มครองสินค้า) หรือหากเกิดความผิดพลาดจากทางร้านค้าจีนหรือผู้จัดจำหน่ายสินค้า ทางบริษัทไม่สามารถรับผิดชอบความเสียหายต่างๆที่เกิดขึ้นได้<br/> ' +
                '3.2 สินค้าประเภทเซรามิค กระเบื้องและเครื่องแก้ว ทางบริษัทขอสงวนสิทธิ์ไม่รับผิดชอบหากสินค้าแตกหักเสียหายทุกกรณี หากลูกค้าต้องการจัดส่งสินค้าประเภทดังกล่าว ควรให้ทางร้านค้าทำการตีลังไม้และจัดส่งสินค้าทางเรือเพื่อลดความเสี่ยงที่สินค้าจะเกิดความเสียหาย<br/> ' +
                '3.3 กรณีคุณลูกค้าส่งสินค้าประเภท อย. มอก. ลิขสิทธิ์ หากสินค้าสูญหายหรือถูกยึด ทางบริษัทขอสงวนสิทธิ์ไม่รับผิดชอบทุกกรณี<br/> ' +
                '4. ระยะเวลาในการขนส่งสินค้าเป็นไปตามมาตรฐานการขนส่งของบริษัท ระยะเวลาที่แจ้งเป็นเวลาโดยเฉลี่ยซึ่งอาจเร็วหรือช้ากว่า ทั้งนี้บริษัทขอสงวนสิทธิ์ในความเสียหายต่อความล่าช้าของสินค้าในทุกกรณี แต่บริษัทจะพยายามจัดส่งสินค้าให้ถึงลูกค้าโดยเร็วที่สุด<br/> ' +
                '5. บริษัทฯขอสงวนสิทธิ์ไม่รับผิดชอบค่าเสียหายที่เกิดขึ้นกรณีสินค้าเสียหายอันเกิดจากการบรรจุภัณฑ์ไม่เหมาะสมกับประเภทสินค้าของทางร้านค้า ซึ่งหากลูกค้าไม่สามารถให้ทางร้านค้าตีลังไม้ได้ ทางบริษัทยินดีดำเนินการตีลังไม้เพื่อป้องกันความเสียหายและจะมีค่าใช้จ่ายในการตีลังไม้เพิ่มเติม<br/> ' +
                '6. ทางบริษัทฯขอสงวนสิทธิ์ในการตรวจเช็คสินค้ากรณีจำเป็นเพื่อระบุและบันทึกสินค้า<br/> ' +
                '7. กรณีคุณลูกค้าไม่มารับสินค้าภายใน1เดือนนับจากวันที่สินค้าเข้าโกดังไทย ทางบริษัทขอสงวนสิทธิ์ในการขายสินค้าทอดตลาด<br/> ' +
                '8. หากคุณลูกค้าเปิดรหัสและใช้บริการขนส่งกับทางบริษัทฯ จะถือว่าท่านรับทราบและยอมรับในข้อตกลงต่างๆข้างต้นทุกกรณี</div>',
            animation: false,
            confirmButtonText: 'ฉันยอมรับ',
            customClass: {
                popup: 'animated tada'
            }
        })
    }
}